RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/include/hardware/aon_reg.h
/* 0x924 : adc converation sequence 4 */
#define AON_GPADC_REG_SCN_NEG2_OFFSET (0x924)
#define AON_GPADC_SCAN_NEG_6          AON_GPADC_SCAN_NEG_6
#define AON_GPADC_SCAN_NEG_6_POS      (0U)
#define AON_GPADC_SCAN_NEG_6_LEN      (5U)
#define AON_GPADC_SCAN_NEG_6_MSK      (((1U << AON_GPADC_SCAN_NEG_6_LEN) - 1) << AON_GPADC_SCAN_NEG_6_POS)
#define AON_GPADC_SCAN_NEG_6_UMSK     (~(((1U << AON_GPADC_SCAN_NEG_6_LEN) - 1) << AON_GPADC_SCAN_NEG_6_POS))
#define AON_GPADC_SCAN_NEG_7          AON_GPADC_SCAN_NEG_7
#define AON_GPADC_SCAN_NEG_7_POS      (5U)
#define AON_GPADC_SCAN_NEG_7_LEN      (5U)
#define AON_GPADC_SCAN_NEG_7_MSK      (((1U << AON_GPADC_SCAN_NEG_7_LEN) - 1) << AON_GPADC_SCAN_NEG_7_POS)
#define AON_GPADC_SCAN_NEG_7_UMSK     (~(((1U << AON_GPADC_SCAN_NEG_7_LEN) - 1) << AON_GPADC_SCAN_NEG_7_POS))
#define AON_GPADC_SCAN_NEG_8          AON_GPADC_SCAN_NEG_8
#define AON_GPADC_SCAN_NEG_8_POS      (10U)
#define AON_GPADC_SCAN_NEG_8_LEN      (5U)
#define AON_GPADC_SCAN_NEG_8_MSK      (((1U << AON_GPADC_SCAN_NEG_8_LEN) - 1) << AON_GPADC_SCAN_NEG_8_POS)
#define AON_GPADC_SCAN_NEG_8_UMSK     (~(((1U << AON_GPADC_SCAN_NEG_8_LEN) - 1) << AON_GPADC_SCAN_NEG_8_POS))
#define AON_GPADC_SCAN_NEG_9          AON_GPADC_SCAN_NEG_9
#define AON_GPADC_SCAN_NEG_9_POS      (15U)
#define AON_GPADC_SCAN_NEG_9_LEN      (5U)
#define AON_GPADC_SCAN_NEG_9_MSK      (((1U << AON_GPADC_SCAN_NEG_9_LEN) - 1) << AON_GPADC_SCAN_NEG_9_POS)
#define AON_GPADC_SCAN_NEG_9_UMSK     (~(((1U << AON_GPADC_SCAN_NEG_9_LEN) - 1) << AON_GPADC_SCAN_NEG_9_POS))
#define AON_GPADC_SCAN_NEG_10         AON_GPADC_SCAN_NEG_10
#define AON_GPADC_SCAN_NEG_10_POS     (20U)
#define AON_GPADC_SCAN_NEG_10_LEN     (5U)
#define AON_GPADC_SCAN_NEG_10_MSK     (((1U << AON_GPADC_SCAN_NEG_10_LEN) - 1) << AON_GPADC_SCAN_NEG_10_POS)
#define AON_GPADC_SCAN_NEG_10_UMSK    (~(((1U << AON_GPADC_SCAN_NEG_10_LEN) - 1) << AON_GPADC_SCAN_NEG_10_POS))
#define AON_GPADC_SCAN_NEG_11         AON_GPADC_SCAN_NEG_11
#define AON_GPADC_SCAN_NEG_11_POS     (25U)
#define AON_GPADC_SCAN_NEG_11_LEN     (5U)
#define AON_GPADC_SCAN_NEG_11_MSK     (((1U << AON_GPADC_SCAN_NEG_11_LEN) - 1) << AON_GPADC_SCAN_NEG_11_POS)
#define AON_GPADC_SCAN_NEG_11_UMSK    (~(((1U << AON_GPADC_SCAN_NEG_11_LEN) - 1) << AON_GPADC_SCAN_NEG_11_POS))

/* 0x928 : gpadc_reg_status */
#define AON_GPADC_REG_STATUS_OFFSET (0x928)
#define AON_GPADC_DATA_RDY          AON_GPADC_DATA_RDY
#define AON_GPADC_DATA_RDY_POS      (0U)
#define AON_GPADC_DATA_RDY_LEN      (1U)
#define AON_GPADC_DATA_RDY_MSK      (((1U << AON_GPADC_DATA_RDY_LEN) - 1) << AON_GPADC_DATA_RDY_POS)
#define AON_GPADC_DATA_RDY_UMSK     (~(((1U << AON_GPADC_DATA_RDY_LEN) - 1) << AON_GPADC_DATA_RDY_POS))
#define AON_GPADC_RESERVED          AON_GPADC_RESERVED
#define AON_GPADC_RESERVED_POS      (16U)
#define AON_GPADC_RESERVED_LEN      (16U)
#define AON_GPADC_RESERVED_MSK      (((1U << AON_GPADC_RESERVED_LEN) - 1) << AON_GPADC_RESERVED_POS)
#define AON_GPADC_RESERVED_UMSK     (~(((1U << AON_GPADC_RESERVED_LEN) - 1) << AON_GPADC_RESERVED_POS))

/* 0x92C : gpadc_reg_isr */
#define AON_GPADC_REG_ISR_OFFSET      (0x92C)
#define AON_GPADC_NEG_SATUR           AON_GPADC_NEG_SATUR
#define AON_GPADC_NEG_SATUR_POS       (0U)
#define AON_GPADC_NEG_SATUR_LEN       (1U)
#define AON_GPADC_NEG_SATUR_MSK       (((1U << AON_GPADC_NEG_SATUR_LEN) - 1) << AON_GPADC_NEG_SATUR_POS)
#define AON_GPADC_NEG_SATUR_UMSK      (~(((1U << AON_GPADC_NEG_SATUR_LEN) - 1) << AON_GPADC_NEG_SATUR_POS))
#define AON_GPADC_POS_SATUR           AON_GPADC_POS_SATUR
#define AON_GPADC_POS_SATUR_POS       (1U)
#define AON_GPADC_POS_SATUR_LEN       (1U)
#define AON_GPADC_POS_SATUR_MSK       (((1U << AON_GPADC_POS_SATUR_LEN) - 1) << AON_GPADC_POS_SATUR_POS)
#define AON_GPADC_POS_SATUR_UMSK      (~(((1U << AON_GPADC_POS_SATUR_LEN) - 1) << AON_GPADC_POS_SATUR_POS))
#define AON_GPADC_NEG_SATUR_CLR       AON_GPADC_NEG_SATUR_CLR
#define AON_GPADC_NEG_SATUR_CLR_POS   (4U)
#define AON_GPADC_NEG_SATUR_CLR_LEN   (1U)
#define AON_GPADC_NEG_SATUR_CLR_MSK   (((1U << AON_GPADC_NEG_SATUR_CLR_LEN) - 1) << AON_GPADC_NEG_SATUR_CLR_POS)
#define AON_GPADC_NEG_SATUR_CLR_UMSK  (~(((1U << AON_GPADC_NEG_SATUR_CLR_LEN) - 1) << AON_GPADC_NEG_SATUR_CLR_POS))
#define AON_GPADC_POS_SATUR_CLR       AON_GPADC_POS_SATUR_CLR
#define AON_GPADC_POS_SATUR_CLR_POS   (5U)
#define AON_GPADC_POS_SATUR_CLR_LEN   (1U)
#define AON_GPADC_POS_SATUR_CLR_MSK   (((1U << AON_GPADC_POS_SATUR_CLR_LEN) - 1) << AON_GPADC_POS_SATUR_CLR_POS)
#define AON_GPADC_POS_SATUR_CLR_UMSK  (~(((1U << AON_GPADC_POS_SATUR_CLR_LEN) - 1) << AON_GPADC_POS_SATUR_CLR_POS))
#define AON_GPADC_NEG_SATUR_MASK      AON_GPADC_NEG_SATUR_MASK
#define AON_GPADC_NEG_SATUR_MASK_POS  (8U)
#define AON_GPADC_NEG_SATUR_MASK_LEN  (1U)
#define AON_GPADC_NEG_SATUR_MASK_MSK  (((1U << AON_GPADC_NEG_SATUR_MASK_LEN) - 1) << AON_GPADC_NEG_SATUR_MASK_POS)
#define AON_GPADC_NEG_SATUR_MASK_UMSK (~(((1U << AON_GPADC_NEG_SATUR_MASK_LEN) - 1) << AON_GPADC_NEG_SATUR_MASK_POS))
#define AON_GPADC_POS_SATUR_MASK      AON_GPADC_POS_SATUR_MASK
#define AON_GPADC_POS_SATUR_MASK_POS  (9U)
#define AON_GPADC_POS_SATUR_MASK_LEN  (1U)
#define AON_GPADC_POS_SATUR_MASK_MSK  (((1U << AON_GPADC_POS_SATUR_MASK_LEN) - 1) << AON_GPADC_POS_SATUR_MASK_POS)
#define AON_GPADC_POS_SATUR_MASK_UMSK (~(((1U << AON_GPADC_POS_SATUR_MASK_LEN) - 1) << AON_GPADC_POS_SATUR_MASK_POS))

/* 0x930 : gpadc_reg_result */
#define AON_GPADC_REG_RESULT_OFFSET (0x930)
#define AON_GPADC_DATA_OUT          AON_GPADC_DATA_OUT
#define AON_GPADC_DATA_OUT_POS      (0U)
#define AON_GPADC_DATA_OUT_LEN      (26U)
#define AON_GPADC_DATA_OUT_MSK      (((1U << AON_GPADC_DATA_OUT_LEN) - 1) << AON_GPADC_DATA_OUT_POS)
#define AON_GPADC_DATA_OUT_UMSK     (~(((1U << AON_GPADC_DATA_OUT_LEN) - 1) << AON_GPADC_DATA_OUT_POS))

/* 0x934 : gpadc_reg_raw_result */
#define AON_GPADC_REG_RAW_RESULT_OFFSET (0x934)
#define AON_GPADC_RAW_DATA              AON_GPADC_RAW_DATA
#define AON_GPADC_RAW_DATA_POS          (0U)
#define AON_GPADC_RAW_DATA_LEN          (12U)
#define AON_GPADC_RAW_DATA_MSK          (((1U << AON_GPADC_RAW_DATA_LEN) - 1) << AON_GPADC_RAW_DATA_POS)
#define AON_GPADC_RAW_DATA_UMSK         (~(((1U << AON_GPADC_RAW_DATA_LEN) - 1) << AON_GPADC_RAW_DATA_POS))

/* 0x938 : gpadc_reg_define */
#define AON_GPADC_REG_DEFINE_OFFSET (0x938)
#define AON_GPADC_OS_CAL_DATA       AON_GPADC_OS_CAL_DATA
#define AON_GPADC_OS_CAL_DATA_POS   (0U)
#define AON_GPADC_OS_CAL_DATA_LEN   (16U)
#define AON_GPADC_OS_CAL_DATA_MSK   (((1U << AON_GPADC_OS_CAL_DATA_LEN) - 1) << AON_GPADC_OS_CAL_DATA_POS)
#define AON_GPADC_OS_CAL_DATA_UMSK  (~(((1U << AON_GPADC_OS_CAL_DATA_LEN) - 1) << AON_GPADC_OS_CAL_DATA_POS))

/* 0x93C : hbncore_resv0 */
#define AON_HBNCORE_RESV0_OFFSET    (0x93C)
#define AON_HBNCORE_RESV0_DATA      AON_HBNCORE_RESV0_DATA
#define AON_HBNCORE_RESV0_DATA_POS  (0U)
#define AON_HBNCORE_RESV0_DATA_LEN  (32U)
#define AON_HBNCORE_RESV0_DATA_MSK  (((1U << AON_HBNCORE_RESV0_DATA_LEN) - 1) << AON_HBNCORE_RESV0_DATA_POS)
#define AON_HBNCORE_RESV0_DATA_UMSK (~(((1U << AON_HBNCORE_RESV0_DATA_LEN) - 1) << AON_HBNCORE_RESV0_DATA_POS))

/* 0x940 : hbncore_resv1 */
#define AON_HBNCORE_RESV1_OFFSET    (0x940)
#define AON_HBNCORE_RESV1_DATA      AON_HBNCORE_RESV1_DATA
#define AON_HBNCORE_RESV1_DATA_POS  (0U)
#define AON_HBNCORE_RESV1_DATA_LEN  (32U)
#define AON_HBNCORE_RESV1_DATA_MSK  (((1U << AON_HBNCORE_RESV1_DATA_LEN) - 1) << AON_HBNCORE_RESV1_DATA_POS)
#define AON_HBNCORE_RESV1_DATA_UMSK (~(((1U << AON_HBNCORE_RESV1_DATA_LEN) - 1) << AON_HBNCORE_RESV1_DATA_POS))

