RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/include/hardware/aon_reg.h
struct aon_reg {
    /* 0x0  reserved */
    uint8_t RESERVED0x0[2048];

    /* 0x800 : aon */
    union {
        struct
        {
            uint32_t aon_resv              : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_11         : 4; /* [11: 8],       rsvd,        0x0 */
            uint32_t pu_aon_dc_tbuf        : 1; /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_19        : 7; /* [19:13],       rsvd,        0x0 */
            uint32_t ldo11_rt_pulldown     : 1; /* [   20],        r/w,        0x0 */
            uint32_t ldo11_rt_pulldown_sel : 1; /* [   21],        r/w,        0x0 */
            uint32_t sw_pu_ldo11_rt        : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23_31        : 9; /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } aon;

    /* 0x804 : aon_common */
    union {
        struct
        {
            uint32_t tmux_aon         : 3;  /* [ 2: 0],        r/w,        0x0 */
            uint32_t reserved_3       : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t ten_aon          : 1;  /* [    4],        r/w,        0x0 */
            uint32_t dten_xtal32k     : 1;  /* [    5],        r/w,        0x0 */
            uint32_t ten_xtal32k      : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reserved_7       : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t ten_vddcore_aon  : 1;  /* [    8],        r/w,        0x0 */
            uint32_t ten_ldo11soc_aon : 1;  /* [    9],        r/w,        0x0 */
            uint32_t ten_dcdc18_0_aon : 1;  /* [   10],        r/w,        0x0 */
            uint32_t ten_dcdc18_1_aon : 1;  /* [   11],        r/w,        0x0 */
            uint32_t ten_bg_sys_aon   : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_15   : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t ten_ldo15rf_aon  : 1;  /* [   16],        r/w,        0x0 */
            uint32_t ten_xtal_aon     : 1;  /* [   17],        r/w,        0x0 */
            uint32_t dten_xtal_aon    : 1;  /* [   18],        r/w,        0x0 */
            uint32_t ten_mbg_aon      : 1;  /* [   19],        r/w,        0x0 */
            uint32_t ten_cip_misc_aon : 1;  /* [   20],        r/w,        0x0 */
            uint32_t reserved_21_31   : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } aon_common;

    /* 0x808 : aon_misc */
    union {
        struct
        {
            uint32_t sw_soc_en_aon : 1;  /* [    0],        r/w,        0x1 */
            uint32_t sw_bz_en_aon  : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reserved_2_31 : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } aon_misc;

    /* 0x80c  reserved */
    uint8_t RESERVED0x80c[4];

    /* 0x810 : bg_sys_top */
    union {
        struct
        {
            uint32_t pmip_resv             : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t pu_bg_sys_aon         : 1;  /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_11         : 3;  /* [11: 9],       rsvd,        0x0 */
            uint32_t bg_sys_start_ctrl_aon : 1;  /* [   12],        r/w,        0x1 */
            uint32_t reserved_13_31        : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } bg_sys_top;

    /* 0x814 : dcdc18_top_0 */
    union {
        struct
        {
            uint32_t reserved_0                : 1; /* [    0],       rsvd,        0x0 */
            uint32_t dcdc18_vout_sel_aon       : 5; /* [ 5: 1],        r/w,       0x1b */
            uint32_t reserved_6_7              : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t dcdc18_vpfm_aon           : 4; /* [11: 8],        r/w,        0x7 */
            uint32_t dcdc18_osc_2m_mode_aon    : 1; /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_15            : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t dcdc18_osc_freq_trim_aon  : 4; /* [19:16],        r/w,        0x8 */
            uint32_t dcdc18_slope_curr_sel_aon : 5; /* [24:20],        r/w,        0x5 */
            uint32_t dcdc18_stop_osc_aon       : 1; /* [   25],        r/w,        0x1 */
            uint32_t dcdc18_slow_osc_aon       : 1; /* [   26],        r/w,        0x0 */
            uint32_t dcdc18_osc_inhibit_t2_aon : 1; /* [   27],        r/w,        0x1 */
            uint32_t dcdc18_sstart_time_aon    : 2; /* [29:28],        r/w,        0x0 */
            uint32_t reserved_30               : 1; /* [   30],       rsvd,        0x0 */
            uint32_t dcdc18_rdy_aon            : 1; /* [   31],          r,        0x1 */
        } BF;
        uint32_t WORD;
    } dcdc18_top_0;

    /* 0x818 : dcdc18_top_1 */
    union {
        struct
        {
            uint32_t dcdc18_force_cs_zvs_aon  : 1; /* [    0],        r/w,        0x0 */
            uint32_t dcdc18_cs_delay_aon      : 3; /* [ 3: 1],        r/w,        0x4 */
            uint32_t dcdc18_zvs_td_opt_aon    : 3; /* [ 6: 4],        r/w,        0x4 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t dcdc18_nonoverlap_td_aon : 5; /* [12: 8],        r/w,        0x0 */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t dcdc18_rc_sel_aon        : 4; /* [19:16],        r/w,        0x8 */
            uint32_t dcdc18_chf_sel_aon       : 4; /* [23:20],        r/w,        0x1 */
            uint32_t dcdc18_cfb_sel_aon       : 4; /* [27:24],        r/w,        0x8 */
            uint32_t dcdc18_en_antiring_aon   : 1; /* [   28],        r/w,        0x1 */
            uint32_t dcdc18_pulldown_aon      : 1; /* [   29],        r/w,        0x0 */
            uint32_t reserved_30_31           : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dcdc18_top_1;

